Repository: mondeja/http-request-codegen
Catalog: docs/*/dev.md.po
Languages: es

source: Development
es: Desarrollo

source: Setup development environment
es: Preparación de entorno de desarrollo

source: Development commands
es: Comandos de desarrollo

source: Test
es: Testeo

source: Lint
es: Linteado

source: Developing implementations
es: Desarrollando implementaciones

source: To develop an HTTP method function for a library or a program, you need to take in accounts all parameters described in [`generate_http_request_code`](/reference#generate_http_request_code) function, but not the randomized values passed in `parameters` argument, because `http_request_codegen` provides functions that can handle these.
es: Para desarrollar una función de un método HTTP para una bilbioteca o un programa, necesitas tener en cuenta todos los parámetros descritos en la función [`generate_http_request_code`](/reference#generate_http_request_code), pero no los valores aleatorios pasados en el argumento `parameters` ya que `http_request_codegen` provee funciones que pueden manejarlos.

source: Implementation arguments
es: Argumentos de implementación

source: Each implementation function must contain the following arguments, which are passed from the API function [`generate_http_request_code`](/reference#generate_http_request_code), so it's recommended that you familiarize yourself with the arguments of that function before continuing with this guide because they are well documented there:
es: Cada función de implementación debe contener los siguientes argumentos, que son pasados de la función de la API [`generate_http_request_code`](/reference#generate_http_request_code), por lo que se recomienda que te familiarices con los argumentos de esa función antes de continuar con esta guía porque están bien documentados ahí:

source: **`url`**: unique positional argument of the function, represents the target URL of the request.
es: **`url`**: único agumento posicional de la función, representa la URL objetivo de la petición.

source: **`headers`**: dictionary of headers.
es: **`headers`**: diccionario de encabezados.

source: **`parameters`**: list of parameter data objects.
es: **`parameters`**: lista de objetos de datos de parámetros.

source: **`files`**: dictionary of files, only passed to POST requests, so this should not be defined as argument is the function implementation's name is different to `post`.
es: **`files`**: diccionario de archivos, sólo pasados a peticiones POST, por lo que esta argumento no debe ser definido si el nombre de la función de implementación es diferente a `post`.

source: **`wrap`**: maximum anchor of the rendered code snippet.
es: **`wrap`**: ancho máximo del trozo de código renderizado.

source: **`indent`**: indentation used in the rendered code snippet.
es: **`indent`**: indentación usada en el trozo de código generado.

source: **`quote_char`**: string quotation character.
es: **`quote_char`**: caracter de limitación de cadenas.

source: **`setup`** : code snippet prepended to generated request output.
es: **`setup`** : trozo de código colocado al principio de la petición generada.

source: **`teardown`** : code snippet appended at the end of the generated request output.
es: **`teardown`** : trozo de código colocado al final de la petición generada.

source: **`oneline`**: if enabled, render the code snippet in one line.
es: **`oneline`**: si se habilita, la renderización del trozo de código se hará en una línea.

source: **`seed`**: seed used generating random fake values of parameters.
es: **`seed`**: semilla usada generando los valores aleatorios falsos de los parámetros.

source: **`locale`**: locale used by [faker](https://faker.readthedocs.io) library to localize the faked random values for parameters.
es: **`locale`**: idioma usado por la biblioteca [faker](https://faker.readthedocs.io) para localizar los valores aleatorios falseados para los parámetros.

source: Method singularities
es: Singularidades de métodos

source: Most POST methods implementations render their code snippets different, depending on *Content-Types* header, including by default some of the most used *Content-Types* header related behaviours:
es: La mayoría de implementaciones de métodos POST renderizan sus trozos de código de forma diferente, dependiendo del encabezado *Content-Types*, incluyendo por defecto algunos de los comportamientos de encabezados *Content-Types* más utilizados:

source: The default behavior, even if you don't specify it explicitly in the *Content-Type* header is the generation of an `application/x-www-form-urlencoded` encoded request.
es: El comportamiento por defecto, incluso si no lo especificas explícitamente en el encabezado *Content-Type* es la generación de una petición codificada como `application/x-www-form-urlencoded`.

source: If you want to generate a `multipart/form-data` encoded request, you need to specify the files to sent using the `files` argument.
es: Si quieres generar una petición codificada como `multipart/form-data`, necesitas especificar los archivos a enviar usando el argumento `files`.

source: If you specifies the *Content-Type* header `application/json`, the parameters sent will be adjusted according to the JSON encoded POST request.
es: Si especificas el encabezado *Content-Type* `application/json`, los parámetros enviados serán ajustados de acuerdo a la petición POST codificada como JSON.

source: If you specifies the *Content-Type* header `text/plain`, you can only send one parameter and it will be adjusted accordingly following the implementation.
es: Si especificas el encabezado *Content-Type* `text/plain`, sólo puedes enviar un parámetro y será ajustado de acuerdo siguiendo la implementación.

source: One line wrapping behaviour
es: Comportamiento de envoltura en una línea

source: The first thing to take in account (and the most complicated one) is the behaviour of wrapping (`wrap` argument) rendering as if `oneline=True` is passed. The question is: can a snippet of code be outputted in one line if the estimated length of the request is lower than `wrap` argument value?
es: La primera cosa a tener en cuenta (y la más complicada) es el comportamiento de envoltura (argumento `wrap`) renderizando como si `oneline=True` fuera pasado. La pregunta es: ¿puede un trozo de código ser renderizado en una línea si el largo estimado de la petición es menor que el valor del argumento `wrap`?

source: For example, Python requests can be rendered using this kind of code, in one line:
es: Por ejemplo, peticiones con la biblioteca requests de Python pueden ser renderizadas usando este tipo de código, en una línea:

source: ...or using multiple lines (`wrap` is lower than expected length):
es: ...o usando múltiples líneas (`wrap` es menor que el largo esperado):

source: Of course, this also affects `parameters`, `headers` and `kwargs`:
es: Por supuesto, esto también afecta a los argumentos `parameters`, `headers` y `kwargs`:

source: ...which can be outputted in multiple lines:
es: ...los cuales pueden ser renderizados en múltiples líneas:

source: Since this behaviour can depend both `oneline` and `wrap` arguments, the recommended way of implement this is to calculate the length of the expected request inside the code snippet, and, if it is greater or equal to `wrap` argument, must be rendered as if `oneline=True`.
es: Ya que este comportamiento puede depender tanto de los argumentos `oneline` y `wrap`, la forma recomendada de implementar esto es calcular el largo de la petición esperada dentro del trozo de código y, si es mayor o igual al argumento `wrap`, debe ser renderizada como si `oneline=True`.

source: But other implementations could be rendered in multiples lines regardless the `wrap` argument value.
es: Pero otras implementaciones podrían ser renderizadas en múltiples líneas sin importar el valor del argumento `wrap`.

source: For example, the Javascript fetch API implementation will output always a multiline code snippet (unless `oneline=True` is explicitly defined), because the Javascript Promises writing in single line is not a common syntax and there is a little chance that the generated request could not be wrapped given the default wrap value (80 in this case). The minimum reasonable possible code snippet in one line for Javascript fetch API implementation would be:
es: Por ejemplo, la implementación de la API fetch de Javascript siempre renderizará un trozo de código multilínea (a no ser que `oneline=True` sea explícitamente definido), ya que la escritura de promesas Javascript en una sóla línea no es una sintaxis común y hay muy poco margen para que la petición generada pudiera no tener que ser evuelta dado el valor de envolura por defecto (80 en este caso). El trozo de código mínimo razonable en una línea para la implementación fetch de la API Javascript sería:

source: ...which exceeds the default `wrap` value length (80). In such type of cases, there is no need of calculate the expected generated code snippet request length before build their output.
es: ...lo cual excede el valor por defecto del argumento `wrap` (80). En este tipo de casos, no hay necesidad de calcular el largo de el trozo de código de la petición antes de construir la salida.

source: In the first case, you need to iterate over `parameters`, `headers` and `kwargs` arguments to compute the expected length, then compare the expected length with `wrap` argument value and, if it reaches it, define an internal `oneline=True` like behaviour. In the second, you can assume that the generated code is multiline unless `oneline=True` is explicitly defined as argument.
es: En el primer caso, necesitas iterar por los argumentos `parameters`, `headers` y `kwargs` para calcular el largo esperado, entonces comparar el largo esperado con el valor del argumento `wrap` y, si lo alcanza, definir una variable interna para el comportamiento `oneline=True`. En el segundo, puedes asumir que el código generado es multilínea a no ser que `oneline=True` sea definido explícitamente como argumento.

source: Randomizing values
es: Aleatorizando valores

source: The library provides the functions [`lazy_name_by_parameter`](/reference#lazy_name_by_parameter) and [`lazy_value_by_parameter`](/reference#lazy_value_by_parameter) which returns the name and the value of a parameter given a parameter dictionary specification. These must be used to randomize parameters in a unified way across implementations as described in [`generate_http_request_code`](/reference#generate_http_request_code) function documentation.
es: La biblioteca provee las funciones [`lazy_name_by_parameter`](/reference#lazy_name_by_parameter) y [`lazy_value_by_parameter`](/reference#lazy_value_by_parameter) las cuales retornan el nombre el valor de un parámetro dada un diccionario de especificación de parámetro. Estos deben ser usados para aleatorizar parámetros de una forma unificada entre implementaciones como se describe en la documentación de la función [`generate_http_request_code`](/reference#generate_http_request_code).

source: Language/platform utilities
es: Utilidades de lenguaje/plataforma

source: You can create an `_utils.py` module inside a language or platform package to store utilities that could help in the process of building the code snippet, like:
es: Puedes crear un módulo `_utils.py` dentro de un paquete de lenguaje o plataforma para almacenar utilidades que puedan ayudar en el proceso de construcción del trozo de código, como:

source: Define default indentation for the language/platform (`indent` argument).
es: Definir la indentación por defecto para el lenguaje/plataforma (argumento `indent`).

source: Define default wrapping length value (`wrap` argument).
es: Definir el valor por defecto de envoltura (argumento `wrap`).

source: Define default quotation character/s (`quote_char` argument).
es: Definir los caracteres de delimitación de cadenas (argumento `quote_char`).

source: Escape quotes of values (according to given `quote_char` argument).
es: Escapar delimitadores de cadenas de valores (de acuerdo al argumento `quote_char` dado).

source: Create greater level functions of code generation for the language/platform, such as string definitions with wrapping behaviour, dictionary definitions...
es: Crear funciones de más alto nivel de generación de código para el lenguaje/plataforma, como definiciones de cadenas de comportamientos de envoltura, definiciones de diccionarios...

source: Creating test cases
es: Creando casos de tests

source: Use the script `scripts/create-impl-test-cases.py` to create possible generated code snippets cases accordingly to combination of arguments. This will help you developing implementations because saves you the need of execute every possible combination of arguments. Use it as follows:
es: Usa el script `scripts/create-impl-test-cases.py` para crear casos posibles de generación de trozos de código de acuerdo a combinaciones de argumentos. Esto te ayudará desarrollando implementaciones ya que te ahorra la necesidad de ejecutar cada posible combinación de argumentos. Úsalo tal como sigue:

source: Previous command will create a `cases/` directory with a lot of code snippets generated, given the combinations described in `tests/combinations.py`.
es: El comando previo creará un directorio `cases/` con un montón de trozos de código generados, dadas las combinaciones descritas en `tests/combinations.py`.

source: When you will have manually revised that all code snippets are generated correctly, you can create a test for the implementation at `tests/test_generators/test_<lang>/test_<impl>/test_<impl>.py`, placing the `cases/` directory at `tests/test_generators/test_<lang>/test_<impl>/<METHOD>`.
es: Cuando hayas revisado manualmente que todos los trozos de código son generados correctamente, puedes crear un test para la implementación en `tests/test_generators/test_<lang>/test_<impl>/test_<impl>.py`, colocando el directorio `cases/` en `tests/test_generators/test_<lang>/test_<impl>/<METHOD>`.

source: For example, for Python requests GET method, the test module would be `tests/test_generators/test_python/test_requests/test_requests.py` and the `cases/` directory would be placed at `tests/test_generators/test_python/test_requests/GET/`.
es: Por ejemplo, para el método GET de la biblioteca requests de Python, el módulo de test estaría en `tests/test_generators/test_python/test_requests/test_requests.py` y el directorio `cases/` estaría emplazado en `tests/test_generators/test_python/test_requests/GET/`.

source: You can see an example of this type of implementation at ``http_request_codegen.http.generators.python.requests::get`` function.
es: Puedes ver un ejemplo de este tipo de implementación en la función ``http_request_codegen.http.generators.python.requests::get``.

source: You can see an example of this type of implementation at ``http_request_codegen.http.generators.javascript.fetch::get`` function.
es: Puedes ver un ejemplo de este tipo de implementación en la función ``http_request_codegen.http.generators.javascript.fetch::get``.

source: See current ``_utils.py`` modules of ``generators`` packages as reference.
es: Ver los módulos ``_utils.py`` actuales de los paquetes de ``generators`` como referencia.

source: You can use an already implemented test module as a reference to write the one for the implementation.
es: Puedes usar un módulo de test ya implementado como referencia escribiendo uno para la implementación.
