Repository: mondeja/http-request-codegen
Catalog: docs/*/index.md.po
Languages: es

source: Introduction
es: Introducción

source: **http-request-codegen** generates HTTP request code snippets for different implementations. It's perfect if you want to include examples documenting APIs. Supports the following features:
es: **http-request-codegen** genera trozos de código de peticiones HTTP para diferentes implementaciones. Es perfecto si quieres incluir ejemplos documentando APIs. Soporta las siguientes características:

source: Request parameters values randomization using multiples strategies:
es: Aleatorización de parámetros de peticiones usando múltiples estrategias:

source: Random values from iterables and callables.
es: Valores aleatorios desde iterables y ejecutables.

source: Random values from data types.
es: Valores aleatorios según tipo de datos.

source: Random values from [Faker providers](https://faker.readthedocs.io/en/master/providers.html).
es: Valores aleatorios desde [proveedores Faker](https://faker.readthedocs.io/en/master/providers.html).

source: Randomization using seeds and localization.
es: Aleatorización usando semillas y localización.

source: Request headers customization.
es: Personalización de encabezados de peticiones.

source: Request optional arguments by implementation.
es: Argumentos opcionales de peticiones por implementación.

source: Custom line wrapping.
es: Envoltura de línea personalizada.

source: Custom indentation.
es: Indentación personalizada.

source: Custom quotation characters.
es: Personalización de caracteres de cadenas.

source: Rendering in one line.
es: Renderizado en una línea.

source: Installation
es: Instalación

source: Demo
es: Demostración

source: Support
es: Soporte
