Repository: mondeja/http-request-codegen
Catalog: docs/*/reference.md.po
Languages: es

source: Reference
es: Referencia

source: Public API
es: API pública

source: Defined as an iterable, the name will be selected randomly from the iterable. Supports recursivity: until a string is not selected the recursion will not be stopped.
es: Definido como un iterable, el nombre será seleccionado aleatoriamente del iterable. Soporta recursividad: si una cadena no es seleccionada la recursión no se detendrá.

source: Defined as a callable, the name will be the returned value of the callable. Supports recursivity: until a string is returned the recursion will not be stopped.
es: Definido como un invocable, el nombre será el valor retornado por el invocable. Soporta recursividad: si una cadena no es seleccionada la recursión no se detendrá.

source: Defined as an iterable, the value will be selected randomly from the iterable. Supports recursivity: until a string is not selected the recursion will not be stopped.
es: Definido como un iterable, el valor será seleccionado aleatoriamente del iterable. Soporta recursividad: si una cadena no es seleccionada la recursión no se detendrá.

source: Defined as a callable, the value will be the returned value of the callable. Supports recursivity: until a string is returned the recursion will not be stopped.
es: Definido como un invocable, el valor será retornado del invocable. Soporta recursividad: si una cadena no es seleccionada la recursión no se detendrá.

source: You can use this function to build the parameters at lower level. This can be used, for example, to append the parameters to an URL generating GET method code snippets if an implementation does by building the parameters as arguments of a function.
es: Puedes usar esta función para construir los parámetros a un nivel más bajo. Esto puede ser usado, por ejemplo, para añadir los parámetros a una URL generando códigos de métodos GET si una implementación los añade como argumentos de una función.

source: Generates a code snippet of an HTTP request for a library of a given programming language or a CLI of a program, based on a valid HTTP method and a specification of parameters.
es: Genera un trozo de código de una petición HTTP para una biblioteca de un lenguaje de programación dado o una interfaz de línea de comandos de un programa, basado en un método HTTP válido y una especificación de parámetros.

source: There are some peculiarities concerning certain methods:
es: Hay algunas peculiaridades concernientes a ciertos métodos:

source: <!-- start-POST-singularities --> Most POST methods implementations render their code snippets different, depending on *Content-Types* header, including by default some of the most used *Content-Types* header related behaviours:
es: <!-- start-POST-singularities --> La mayoría de implementaciones de métodos POST renderizan sus trozos de código diferente, dependiendo del encabezado *Content-Types*, incluyendo por defecto algunos de los comportamientos según dicho encabezado más usados:

source: The default behavior, even if you don't specify it explicitly in the *Content-Type* header is the generation of an `application/x-www-form-urlencoded` encoded request.
es: El comportamiento por defecto, incluso si no lo especificas explícitamente en el encabezado *Content-Type* es la generación de una petición codificada como `application/x-www-form-urlencoded`.

source: If you want to generate a ``multipart/form-data`` encoded request, you need to specify the files to sent using the ``files`` argument.
es: Si quieres generar una petición codificada como ``multipart/form-data``, necesitas especificar los archivos a enviar usando el argumento ``files``.

source: If you specifies the *Content-Type* header `application/json`, the parameters sent will be adjusted according to the JSON encoded POST request.
es: Si especificas el encabezado *Content-Type* `application/json`, los parámetros enviados serán ajustados de acuerdo a la petición POST codificada como JSON.

source: If you specifies the *Content-Type* header `text/plain`, you can only send one parameter and it will be adjusted accordingly following the implementation. <!-- end-POST-singularities -->
es: Si especificas el encabezado *Content-Type* `text/plain`, sólo puedes enviar un parámetro y será ajustado de acordemente siguiendo la implementación. <!-- end-POST-singularities -->

source: Programming language or plataform of the resulting code snippet. See [Support](/#support) to check the supported platforms and programming languages.
es: Lenguaje de programación o plataforma del trozo de código resultante. Ver [Soporte](/es/#soporte) para comprobar las plataformas y lenguajes de programación soportados.

source: Implementation type used for the code snippet. It can be a library, a program, or a language API. See [Support](/#support) to check the supported implementations by language.
es: Tipo de implementación usada para el trozo de código. Puede ser una biblioteca, un programa o la API de un lenguaje. Ver [Soporte](/es/#soporte) para comprobar las implementaciones soportadas por lenguaje.

source: HTTP method of the generated request.
es: Método HTTP de la petición generada.

source: URL endpoint of the generated request.
es: Endpoint URL de la petición generada.

source: Defined as a string, the url will be the string itself.
es: Definido como una cadena, la url será la cadena misma.

source: Defined as an iterable, the url will be selected randomly from the iterable. Supports recursivity: until a string is not selected the recursion will not be stopped.
es: Definido como un iterable, la url será seleccionada aleatoriamente del iterable. Soporta recursividad: hasta que una cadena no se seleccione la recursión no se detendrá.

source: Defined as a callable, the url will be the returned value of the callable. Supports recursivity: until a string is returned the recursion will not be stopped.
es: Definido como un invocable, la url será el valor retornado por el invocable. Soporta recursividad: hasta que una cadena no se seleccione la recursión no se detendrá.

source: Mapping of request header names and values.
es: Mapeo de nombres y valores de encabezados.

source: List of parameters for the request. Each parameter must be a dictionary. This dictionary defines, for each parameter, what is the parameter name and how are the parameters values generated:
es: Lista de parámetros para la petición. Cada parámetro debe ser un diccionario. Este diccionario define, para cada parámetro, cual es el nombre del parámetro y como son generados los valores del parámetro:

source: **name** (*str*, *list*, *function*): Parameter name. At least one of this or ``names`` attributes are required.
es: **name** (*str*, *list*, *function*): Nombre del parámetro. Al menos este el atributo ``names`` son requeridos.

source: Defined as a string, the name will be the string itself.
es: Definido como una cadena, el nombre será la cadena misma.

source: **names** (*str*, *list*, *function*): Parameter name. At least one of this or ``name`` attributes are required.
es: **names** (*str*, *list*, *function*): Nombre del parámetro. Al menos este o el atributo ``name`` son requeridos.

source: Defined as a string, must be a Python formatted module path following the format ``'path.to.module::function'`` and the return name will be used as the name for the parameter, which is useful if choosing a random value from a list doesn't fit your needs.
es: Definido como una cadena, debe ser un módulo de Python formateado como una ruta siguiendo el formato ``'ruta.al.modulo::nombre_de_funcion'`` y el nombre retornado será usado como el nombre para el parámetro, lo que es útil si elegir un valor aleatorio de una lista no se ajusta a tus necesidades.

source: **type** (*str*, *iterable*, *callable*): Parameter data type. If not defined and ``value``, ``values`` and ``faker`` are not defined, will be considered as a string and the value of the parameter will be a random word built using [faker]( https://faker.readthedocs.io) library. For some types, other parameter dictionary attributes are supported, documented, if so, in each type. The following parameter data types are supported as attributes of parameters dictionaries, as well as their corresponding names in capital letters:
es: **type** (*str*, *iterable*, *callable*): Tipo de dato del parámetro. Si no se define y ``value``, ``values`` y ``faker`` tampoco lo son, será considerada como una cadena y el valor del parámetro será una palabra aleatoria construida usando la biblioteca [faker](https://faker.readthedocs.io). Para algunos tipos, otros atributos están soportados dentro del diccionario de parámetros, documentados si es así en cada tipo. Los siguientes tipos de parámetros según el tipo de dato están soportados como atributos de diccionarios de parámetros, así como sus correspondientes nombres en letras mayúsculas:

source: ``'str'``: Basic string type. Can be defined with the Python builtin type ``str`` or the strings ``'str'`` and ``'string'``.
es: ``'str'``: Tipo básico de cadena. Puede ser definido con el tipo integrado en Python ``str`` o las cadenas ``'str'`` y ``'string'``.

source: ``'int'``: Basic integer type. Can be defined with the Python builtin type ``int``, or the strings ``'int'`` and ``'integer'``. As default will be an integer in the range -65536 to 65536. The minimum and maximum values can be defined with ``min`` and ``max`` parameter optional attributes.
es: ``'int'``: Tipo entero básico. Puede ser definido con el tipo integrado en Python ``int`` o las cadenas ``'int'`` e ``'integer'``. Por defecto, será un entero en el rango -65536 a 65536. Los valores mínimos y máximos posibles pueden ser definidos con los atributos opcionales ``min`` y ``max``.

source: ``'float'``: Floating point number type. Can be defined with the Python builtin type ``float``, or the strings ``'float'`` and ``number``. As default will be in the range -65536 to 65536. The minimum and maximum values can be defined with ``min`` and ``max`` parameter optional attributes and can be rounded with ``round`` Python builtin function using ``round`` parameter optional attribute.
es: ``'float'``: Tipo de número decimal. Puede ser definido con el tipo de dato integrado en Python ``float`` o las cadenas ``'float'`` y ``number``. Por defecto será en el rango -65536 to 65536. Los valores máximos y mínimos posibles pueden ser definidos con los atributos de parámetro opcionales ``min`` y ``max`` y pueden ser redondeados con la función integrada en Python ``round`` usando el atributo ``round``.

source: ``'bool'``: Basic boolean type. Can be defined with the Python builtin type ``bool``, or the strings ``'bool'`` and ``'boolean'``. Returns as parameter value one of the strings ``'true'`` or ``'false'``. If you pass the optional parameter attribute ``null`` as ``True``, the string ``'null'`` can also be returned.
es: ``'bool'``: Tipo básico booleano. Puede ser definido con el tipo de dato integrado en Python ``bool`` o las cadenas ``'bool'`` y ``'boolean'``. Retorna como valor del parámetro una de las cadenas ``'true'`` o ``'false'``. Si pasas el atributo de parámetro opcional ``null`` como ``True``, la cadena ``'null'`` también puede ser retornada.

source: ``'uuid'``: Unique identifier type. Can be defined with the Python type ``uuid.UUID``, or the strings ``'uuid'`` and ``'uuid4'``. It's a unique identifier v4 encoded as hexadecimal string.
es: ``'uuid'``: Tipo de identificador único. Puede ser definido con el tipo Python ``uuid.UUID`` o las cadenas ``'uuid'`` y ``'uuid4'``. Es un identificador único v4 codificado como una cadena hexadecimal.

source: ``'id'``: Basic integer id. It's a positive integer in the range 1 to 65536. The maximum value can be defined by optional ``max`` attribute.
es: ``'id'``: Básico identificador como clave primaria. Es un entero positivo en el rango 1 a 65536. El valor máximo puede ser definido por el atributo opcional ``max``.

source: ``'random'``: Random type between the available types. You can define a set of possible types passing an iterable to ``types`` optional parameter attribute.
es: ``'random'``: Tipo aleatorio entre todos los tipos disponibles. Puedes definir una serie de tipos posibles pasando un iterable al atributo opcional de parámetro ``types``.

source: Defined as an iterable or callable, the type will be selected randomly from the iterable, or the returned value from the callable will be used. This allows you to select a random type from a list of custom predefined types.
es: Definido como un iterable o invocable, el tipo será seleccionado aleatoriamente desde el iterable, o el valor retornado desde el invocable será usado. Esto te permite seleccionar un tipo aleatorio de una lista de tipos predefinidos.

source: **value** (*str*, *iterable*, *callable*): Parameter value. If not defined and ``type``, ``values`` and ``faker`` are not defined, the value of the parameter will be a random word built using faker library.
es: **value** (*str*, *iterable*, *callable*): Valor del parámetro. Si no está definido y ``type``, ``values`` y ``faker`` tampoco lo están, el valor del parámetro será una palabra aleatoria construída usando la biblioteca faker.

source: Defined as a string, the value will be the string itself.
es: Definido como una cadena, el valor será la cadena misma.

source: **values** (*list*, *iterable*, *callable*): Possible parameter values.
es: **values** (*list*, *iterable*, *callable*): Posibles valores para el parámetro.

source: Defined as a string, must be a Python formatted module path following the format ``'path.to.module::function'`` and the return value will be used as the value for the parameter, which is useful if choosing a random value from a list doesn't fit your needs.
es: Definido como una cadena, debe ser un módulo de Python formateado como una ruta de módulo siguiendo el formato ``'ruta.al.modulo::nombre_de_funcion'`` y el valor retornado será usado como el valor para el parámetro, lo cual es útil si elegir un valor aleatorio de una lista no se ajusta a tus necesidades.

source: **faker** (*str*, *function*): Python formatted module path to a function of a Faker provider used to build the value randomized. Can be a standard, external provider or any function, but if is not a provider, ``seed`` and ``locale`` will not have effect.
es: **faker** (*str*, *function*): Ruta a módulo formateada al estilo Python hacia una función de un proveedor Faker usado para construir el valor aleatorio. Puede ser un proveedor estándar, externo o cualquier función, pero si no es un proveedor, ``seed`` y ``locale`` no tendrán efecto.

source: Defined as a string must follow the format ``'path.to.provider.module::function'``.
es: Definido como una cadena debe seguir el formato ``'path.to.provider.module::function'``.

source: Mapping of files to send to URL. Only has effect for POST methods. If you define this argument, the `Content-Type` header of the request will be assumed to be `'multipart/form-data'`, but only will be explicitly specified in the code generated if the implementation needs it. Each value accepts a string, ``None`` or a tuple:
es: Mapeado de archivos a enviar a la URL. Sólo tiene efecto para métodos POST. Si defines este argumento, el encabezado `Content-Type` de la petición será asumido como `'multipart/form-data'`, pero sólo será explícitamente especificado en el código generado si la implementación lo necesita. Cada valor acepta una cadena, ``None`` o una tupla:

source: Defined as a string, must be the filepath of the file to be sent.
es: Definido como una cadena, debe ser la ruta al archivo a enviar.

source: Defined as ``None``, the filepath will be randomized using ``faker.providers.file::file_path`` function.
es: Definido como ``None``, la ruta al archivo será aleatoria usando la función ``faker.providers.file::file_path``.

source: Defined as a tuple, the first value must be the filepath of the file to be sent (if ``None`` will be a randomized filepath), the second value the content-type of the file and the third a dictionary of custom headers for the file.
es: Definido como una tupla, el primer valor debe ser la ruta del archivo a enviar (si es ``None`` será aleatoria), el segundo valor el tipo de contenido del archivo y el tercer valor un diccionario de encabezados personalizados para el archivo.

source: Maximum anchor of the rendered code snippet. If it exceeds it, the rendered code will be conveniently formatted on multiple lines.
es: Ancho máximo del trozo de código generado. Si se excede, el código renderizado será convenientemente formateado en múltiples líneas.

source: Indentation string used in the generated code. If not defined, the indentation string commonly used in the implementation will be used.
es: Cadena de indentación usada en el código generado. Si no se define se usará la cadena de indentación más comúnmente usada para la implementación.

source: Quotation character for strings used in the generated code.
es: Caracter de puntuación para cadenas usados en el código generado.

source: If ``True``, includes the code needed by an implementation to perform the request. Could be imports of additional modules or intialization of objects, depends on implementation. You can customize this snippet passing a string with the code snippet that you want to include.
es: Si es ``True``, incluye el código necesitado por una implementación para realizar la petición. Podrían ser importaciones de módulos adicionales o inicialización de objetos, dependiendo de la implementación. Puedes personalizar este trozo pasando una cadena con el trózo de código que quieres incluir.

source: Code snippet to include after the HTTP request code.
es: Trozo de código a incluir después del código de la petición HTTP.

source: Render the code in a single line.
es: Renderiza el código en sólo una línea.

source: Seed used generating random fake values of parameters. Useful if you want to generate the same set of values between multiples code snippets.
es: Semilla usada generando valores aleatorios falsos de parámetros. Útil si quieres generar el mismo conjunto de valores entre diferentes trozos de código.

source: Locale used by [faker](https://faker.readthedocs.io) library to localize the faked random values for parameters.
es: Local usada por la biblioteca [faker](https://faker.readthedocs.io) para localizar los valores aleatorios falsos para los parámetros.

source: Value is not a valid value in their context.
es: Valor no es un valor válido en su contexto.

source: Values does not complaint with the types supported for it.
es: Valores no concuerdan con los tipos soportados para ellos.

source: Python module-function path specified can not be imported successfully.
es: Función-modulo de Python especificada no puede ser importada con éxito.

source: HTTP request code snippet.
es: Trozo de código de petición HTTP.

source: Wraps [``generate_http_request_code``](#generate_http_request_code) function result in a Markdown fenced code block.
es: Envuelve la función [``generate_http_request_code``](#generate_http_request_code) en un bloque de código Markdown.

source: Code block fence string used wrapping the code. It does not perform any check about if the fenced string is a "valid" markdown code block fence string.
es: Cadena de caracteres que delimita el inicio y el final del bloque de cógido. No realiza ninguna comprobación sobre si la cadena es válida.

source: All other optional arguments are passed to [``generate_http_request_code``](#generate_http_request_code) function.
es: Todos los otros argumentos opcionales son pasados a la función [``generate_http_request_code``](#generate_http_request_code).

source: Fenced code block with HTTP request code snippet inside.
es: Bloque de código Markdown con el trózo de código de la petición dentro.

source: Given a dictionary of parameter options, returns the corresponding parameter name built following the rules listed in ``parameters`` argument of [``generate_http_request_code``](#generate_http_request_code) function documentation.
es: Dado un diccionario de opciones de parámetros, retorna el nombre de parámetro correspondiente construido siguiendo las reglas listadas en la documentación del argumento ``parameters`` de la función [``generate_http_request_code``](#generate_http_request_code).

source: The strategy of name building is to check next attributes in given order:
es: La estrategia de construcción de nombre es comprobar los siguientes atributos en el orden dado:

source: Parameter specification data. It's defined at **name** and **names** sections of ``parameters`` argument of [``generate_http_request_code``](#generate_http_request_code) function documentation.
es: Datos de especificación de parámetro. Estan definidos en las secciones **name** y **names** de la documentación de la función [``generate_http_request_code``](#generate_http_request_code).

source: Seed using randomizing names.
es: Semilla usada aleatorizando nombres.

source: none of the ``name`` or ``names`` attributes are defined inside ``parameter_data`` dictionary.
es: ninguno de los atributos ``name`` o ``name`` están definidos dentro del diccionario ``parameter_data``.

source: Parameter name.
es: Nombre de parámetro.

source: Given a dictionary of parameter options, returns the corresponding value built following the rules listed in ``parameters`` argument of [``generate_http_request_code``](#generate_http_request_code) function documentation.
es: Dado un diccionario de opciones de parámetros, retorna el valor correspondiente construido siguiendo las reglas listadas en el argumento ``parametros`` de la documentación de la función [``generate_http_request_code``](#generate_http_request_code).

source: For example, giving ``{'type': int}`` as input, the output will be a random number as string.
es: Por ejemplo, dado ``{'type': int}`` como entrada, la salida será un número aleatorio como cadena.

source: The strategy of value building is to check next attributes in given order:
es: La estrategia de construcción del valor es comprobar los siguientes atributos en el orden dado:

source: Parameter specification data. It's defined at **type**, **value**, **values** and **faker** sections of ``parameters`` argument as is defined at [``generate_http_request_code``](#generate_http_request_code) function documentation.
es: Datos de especificación de parámetro. Están definidos en las secciones **type**, **value**, **values** y **faker** del argumento ``parameters`` en la documentación de la función [``generate_http_request_code``](#generate_http_request_code).

source: Seed using randomizing values.
es: Semilla usada aleatorizando valores.

source: Locale used for ``faker`` providers.
es: Local usada por los proveedores de ``faker``.

source: ``'values'`` attribute value points to an inexistent Python object.
es: el atributo ``values`` apunta a un objeto de Python inexsistente.

source: ``'faker'`` attribute value, when passed as string, points to an inexistent Python object.
es: valor del atributo ``faker``, cuando es pasada como cadena, apunta un objeto de Python inexistente.

source: Parameter value.
es: Valor de parámetro.

source: If none of the previous attributes are passed will be treated as if ``{'type': str}`` has been passed, returning a random word.
es: Si no se pasan ninguno de los atributos previos será tratado como si se hubiera pasado ``{'type': str}``, retornando una palabra aleatoria.

source: ``'faker'`` attribute value does not contains a string or Python callable object, or if the ``'type'`` attribute value does not support the defined type.
es: el valor del atributo ``'faker'`` no contiene una cadena o un objeto de Python invocable, o si el atributo ``'type'`` no soporta el tipo definido.
